ezydoez-ezrahogori/STM32F4_UART_DRIVER/5_uart_tx/Src/main.c
#include<stm32f4xx.h>
#include<stdint.h>

#define     GPIOAEN        (1U<<0)
#define     UART2EN        (1U<<17)
#define     SYS_FREQ       16000000
#define     APB1_CLK        SYS_FREQ
#define     URT_BAUDRATE    115200

#define      CR1_TE         (1U<<3)
#define      CR1_UE         (1U<<13)

#define      SR_TX         (1U<<7)

static void uart_uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClck, uint32_t BaudRate );
static uint16_t compute_uart_bd(uint32_t PeriphClck, uint32_t BaudRate);

void uart2_tx_init(void);
void uart2_write(int ch);

int  main(void){

	uart2_tx_init();


	while(1)
	{
		uart2_write('Y');
	}
}


void uart2_tx_init(void){
	/*******Configure uart gpio pin******/
	/*Enable clock access to gpioa*/
	RCC->AHB1ENR |= GPIOAEN;
	/*Set PA2 to alternate function mode*/
	GPIOA->MODER &=~(1U<<4);
	GPIOA->MODER |=(1U<<5);
	/*Set the alternate function type to UART_TX(AF07)*/
	GPIOA->AFR[0] |= (1U<<8);
	GPIOA->AFR[0] |= (1U<<9);
	GPIOA->AFR[0] |= (1U<<10);
	GPIOA->AFR[0] &=~(1U<<11);


	/*******Configure uart uart module******/
	/*Enable clock access to uart2*/
	RCC->APB1ENR |= UART2EN;
	/*configure the baudrate*/
	uart_uart_set_baudrate(USART2,APB1_CLK,URT_BAUDRATE  );
	/*Configure the transfer direction*/
	USART2->CR1  = CR1_TE;
	/*Enable the uart2 module*/
	USART2->CR1 |= CR1_UE;

}


void uart2_write(int ch)
{
	/*make sure the transmit data register is empty*/
	while(!(USART2->SR &=~SR_TX)){}
	/*write to transmit data register*/
	USART2->DR = (ch & 0xFF);

}


static void uart_uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClck, uint32_t BaudRate )
{
	USARTx->BRR = compute_uart_bd(PeriphClck, BaudRate);    //accessing the baudrate register and passing the computation result
}

static uint16_t compute_uart_bd(uint32_t PeriphClck, uint32_t BaudRate)
{

	return (((PeriphClck + (BaudRate/2U))/BaudRate));
}
